Pandas
Pandas is a Python library. 
Pandas is used to analyze data.
Pandas is a powerful and open-source Python library.
Pandas consist of data structures and functions to perform efficient operations on data.
Pandas is well-suited for working with tabular data, such as spreadsheets or SQL tables.

<!-- Import Library -->

In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

Pandas Series with Python Lists

In [3]:
lst=[1,2,3,4,5,6]
print(lst)

[1, 2, 3, 4, 5, 6]

In [4]:
# A Pandas Series is a one-dimensional labeled array .The axis labels are collectively called indexes.
series=pd.Series(lst)
print(series)

print(type(series))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
# Create empty series
empty=pd.Series([])
print(empty)

Series([], dtype: object)

In [8]:
# Defining own indexes
a=pd.Series(['p','q','r','s','t'] , index=[10,11,12,13,14])
a

10    p
11    q
12    r
13    s
14    t
dtype: object

In [9]:
# Giving name to a series
b=pd.Series(['p','q','r','s','t'] , index=[10,11,12,13,14],name='alphabet')
b

10    p
11    q
12    r
13    s
14    t
Name: alphabet, dtype: object

In [10]:
# If we take the scalar values, then the index must be 
# provided. The scalar value will be repeated for matching the length of the index.

scalar_series=pd.Series(0.5)
scalar_series

0    0.5
dtype: float64

In [11]:
scalar_series=pd.Series(0.5,index=[1,2,3])
scalar_series

1    0.5
2    0.5
3    0.5
dtype: float64

Pand Series with Python Dictionary

Dictionary = {Key:value}

In [12]:
dict_series=pd.Series({'p':1,'q':2,'r':3,'s':4,'t':5})
dict_series

p    1
q    2
r    3
s    4
t    5
dtype: int64

In [13]:
# Accessing data
dict_series[0]

C:\Users\91730\AppData\Local\Temp\ipykernel_16212\400811155.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[0]

1

In [14]:
# Print from 0-2
dict_series[0:3]

p    1
q    2
r    3
dtype: int64

In [15]:
# print maximum
max(dict_series)

5

In [16]:
# Combing dictionay and list(incresing no. of columns)

dict_series=pd.Series({'p':[1,5,6],'q':[2,6,7],'r':[3,9,0],'s':[4,4,5],'t':[5,1,2]})
dict_series

p    [1, 5, 6]
q    [2, 6, 7]
r    [3, 9, 0]
s    [4, 4, 5]
t    [5, 1, 2]
dtype: object

#Pandas DataFrames

In [ ]:
import pandas as pd

In [17]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

DataFrame Using List

In [18]:
lst=[1,2,3,4,5]
df=pd.DataFrame(lst)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [19]:
# Multiple columns
lst=[[1,2,3,4,5],[11,12,13,14,15]]
df=pd.DataFrame(lst)
df

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

DataFrame Using Dictionay

In [21]:
a=[{'a':5,'b':7,'c':9,'d':2},{'a':4,'b':8,'c':19,'d':12}]  #Dictionay Keys represent column names

df=pd.DataFrame(a)
print(df)

   a  b   c   d
0  5  7   9   2
1  4  8  19  12

DataFrames Using Panda Series

In [22]:
b={'RollNo.':pd.Series([1,2,3,4,5]),'Maths':pd.Series([67,89,23,90,56]),'Physics':pd.Series([12,98,44,90,78])}

df=pd.DataFrame(b)
df

   RollNo.  Maths  Physics
0        1     67       12
1        2     89       98
2        3     23       44
3        4     90       90
4        5     56       78

Reading CSV(Common Separated Values) as DataFrames
CSV v/s Excel -

In [23]:
df=pd.read_csv('C:\\Users\\91730\\Data Analysis & Visualisation\\Salary_Data.csv')
df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [24]:
type(df)

pandas.core.frame.DataFrame

#DataFrame Functions

In [25]:
import pandas as pd

In [26]:
df=pd.read_csv('C:\\Users\\91730\\Data Analysis & Visualisation\\Salary_Data.csv')

In [28]:
# columns in DataFrame
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [29]:
# shape : (rows,column)
df.shape

(30, 2)

In [30]:
# size : no. of cells = rows x columns
df.size

60

In [31]:
# **IMP  head() : Gives you the first 5 rows as default
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [32]:
df.head(2) # head(2) implies first 2 rows of dataset

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0

In [33]:
df.head(8)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0

In [34]:
# **IMP tail(): Gives you the last 5 rows 
df.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [35]:
df.tail(8) # last 8 rows

    YearsExperience    Salary
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [36]:
# describe() : Give statistical summary of numerical data
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [37]:
# info() : prints information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

<!-- Another data dest -Resturant -->

In [38]:
df2=pd.read_csv('C:\\Users\\91730\\Data Analysis & Visualisation\\Restaurant.csv')
df2.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [39]:
df2.shape

(250, 9)

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              250 non-null    int64
 1   Restaurant        250 non-null    object
 2   Content           33 non-null     object
 3   Sales             250 non-null    int64
 4   YOY_Sales         250 non-null    object
 5   Units             250 non-null    int64
 6   YOY_Units         250 non-null    object
 7   Headquarters      52 non-null     object
 8   Segment_Category  250 non-null    object
dtypes: int64(3), object(6)
memory usage: 17.7+ KB

In [41]:
df2.describe()

             Rank        Sales         Units
count  250.000000    250.00000    250.000000
mean   125.500000   1242.74000    850.076000
std     72.312977   3365.22882   2296.151659
min      1.000000    126.00000     13.000000
25%     63.250000    181.00000     85.000000
50%    125.500000    330.00000    207.000000
75%    187.750000    724.75000    555.250000
max    250.000000  40412.00000  23801.000000

#Handling Missing Values

**
when we are training a machine learing model we can't have null values the compiler will give you the error that dataset consist of null values.

In [42]:
import pandas as pd

In [43]:
df=pd.read_csv('C:\\Users\\91730\\Data Analysis & Visualisation\\sample.csv')
df.head()

   Roll No.  Physics  Chemistry  Maths  Computer
0         1     56.0       57.0   58.0      59.0
1         2     23.0       24.0   25.0      26.0
2         3     89.0       25.0   26.0      27.0
3         4     45.0       26.0   27.0      28.0
4         5     23.0       27.0   28.0      29.0

In [44]:
# HOw to check whether mu data frame have null values or not.
df.isnull()

    Roll No.  Physics  Chemistry  Maths  Computer
0      False    False      False  False     False
1      False    False      False  False     False
2      False    False      False  False     False
3      False    False      False  False     False
4      False    False      False  False     False
5      False    False       True  False     False
6      False    False      False  False     False
7      False    False      False  False     False
8      False     True      False  False     False
9      False    False      False  False     False
10     False     True      False  False     False
11     False    False       True  False     False
12     False    False      False  False     False
13     False    False       True   True     False
14     False     True      False  False     False
15     False    False      False  False     False
16     False    False      False  False     False
17     False    False      False  False     False
18     False    False      False  False     False
19     False    False      False  False     False
20     False    False      False  False     False
21     False    False      False  False     False
22     False    False      False  False     False
23     False    False      False  False     False
24     False    False       True   True     False
25     False    False      False  False     False
26     False    False      False  False     False
27     False    False      False  False      True
28     False    False      False  False     False
29     False    False      False  False     False

In [45]:
# How many null values 
df.isnull().sum()

Roll No.     0
Physics      3
Chemistry    4
Maths        2
Computer     1
dtype: int64

In [46]:
# how many total null values in whole dataset
df.isnull().sum().sum()

10

Dropping Rows with NaN Values(Removing Null Values)

In [47]:
# current dimension of dataset with null values
df.shape

(30, 5)

In [48]:
# function to remove rows containg null values :dropna()
df2=df.dropna()    # default axis =0

In [49]:
# dimension of dataset without null values
df2.shape

(22, 5)

Dropping Columns with NaN Values(Removing Null Values)

In [50]:
df3=df.dropna(axis=1)         #axis=1  for column

In [51]:
df3.shape

(30, 1)

"any" : remove that row that conatin null value

In [52]:
df.dropna(how='any')

    Roll No.  Physics  Chemistry  Maths  Computer
0          1     56.0       57.0   58.0      59.0
1          2     23.0       24.0   25.0      26.0
2          3     89.0       25.0   26.0      27.0
3          4     45.0       26.0   27.0      28.0
4          5     23.0       27.0   28.0      29.0
6          7     12.0       13.0   14.0      15.0
7          8     78.0       14.0   15.0      16.0
9         10     45.0       16.0   17.0      18.0
12        13     22.0       23.0   24.0      25.0
15        16     44.0       44.0   44.0      44.0
16        17     45.0       45.0   45.0      45.0
17        18     46.0       46.0   46.0      46.0
18        19     47.0       47.0   47.0      47.0
19        20     48.0       48.0   48.0      48.0
20        21     49.0       49.0   49.0      49.0
21        22     50.0       50.0   50.0      50.0
22        23     51.0       51.0   51.0      51.0
23        24     52.0       52.0   52.0      52.0
25        26     54.0       33.0   33.0      54.0
26        27     55.0       34.0   34.0      55.0
28        29     57.0       36.0   36.0      66.0
29        30     58.0       37.0   37.0      43.0

"all" : remove the row if ALL values of that row is null.

In [53]:
df.dropna(how='all')

    Roll No.  Physics  Chemistry  Maths  Computer
0          1     56.0       57.0   58.0      59.0
1          2     23.0       24.0   25.0      26.0
2          3     89.0       25.0   26.0      27.0
3          4     45.0       26.0   27.0      28.0
4          5     23.0       27.0   28.0      29.0
5          6     90.0        NaN   29.0      30.0
6          7     12.0       13.0   14.0      15.0
7          8     78.0       14.0   15.0      16.0
8          9      NaN       15.0   16.0      17.0
9         10     45.0       16.0   17.0      18.0
10        11      NaN       17.0   18.0      19.0
11        12     88.0        NaN   19.0      20.0
12        13     22.0       23.0   24.0      25.0
13        14     90.0        NaN    NaN      42.0
14        15      NaN       43.0   43.0      43.0
15        16     44.0       44.0   44.0      44.0
16        17     45.0       45.0   45.0      45.0
17        18     46.0       46.0   46.0      46.0
18        19     47.0       47.0   47.0      47.0
19        20     48.0       48.0   48.0      48.0
20        21     49.0       49.0   49.0      49.0
21        22     50.0       50.0   50.0      50.0
22        23     51.0       51.0   51.0      51.0
23        24     52.0       52.0   52.0      52.0
24        25     53.0        NaN    NaN      53.0
25        26     54.0       33.0   33.0      54.0
26        27     55.0       34.0   34.0      55.0
27        28     56.0       35.0   35.0       NaN
28        29     57.0       36.0   36.0      66.0
29        30     58.0       37.0   37.0      43.0

inplace=True : Make a new dataset that does not cantain null values

In [54]:
df.dropna(inplace=True)

In [55]:
df.shape

(22, 5)

In [57]:
df.isnull()

    Roll No.  Physics  Chemistry  Maths  Computer
0      False    False      False  False     False
1      False    False      False  False     False
2      False    False      False  False     False
3      False    False      False  False     False
4      False    False      False  False     False
6      False    False      False  False     False
7      False    False      False  False     False
9      False    False      False  False     False
12     False    False      False  False     False
15     False    False      False  False     False
16     False    False      False  False     False
17     False    False      False  False     False
18     False    False      False  False     False
19     False    False      False  False     False
20     False    False      False  False     False
21     False    False      False  False     False
22     False    False      False  False     False
23     False    False      False  False     False
25     False    False      False  False     False
26     False    False      False  False     False
28     False    False      False  False     False
29     False    False      False  False     False